app/Views/kawil/v_dashboard.php

              $db = \Config\Database::connect();
              $no = 1;
              foreach ($pendidikan as $w => $value) {
                $jml = $db->table('tbl_penduduk')
                  ->where('id_pendidikan', $value['id_pendidikan'])
                  ->countAllResults();              ?>
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_penduduk`
WHERE `id_pendidikan` = '0'