app/Views/layout/head_view.php

<?php
$db = \Config\Database::connect();

$web = $db->table('tbl_setting')
    ->where('id', 1)
    ->get()->getRowArray();
---
SELECT *
FROM `tbl_setting`
WHERE `id` = 1