app/Views/keluarga/keluarga_view.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_penduduk`
WHERE `no_kk` = '3203182607150010'
AND `status` = '1'
---
                            $db = \Config\Database::connect();
                            $no = 1;
                            foreach ($data_keluarga as $w => $value) {
                                $jml = $db->table('tbl_penduduk')
                                    ->where('no_kk', $value['no_kk'])
                                    ->where('status', '1')
                                    ->countAllResults();