app/Models/Model_pindah.php

    public function AllData()
    {
        return $this->db->table('tbl_pindah')
            ->join('tbl_penduduk', 'tbl_penduduk.id_penduduk=tbl_pindah.id_penduduk', 'left')
            ->orderBy('id_pindah', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_pindah`
LEFT JOIN `tbl_penduduk` ON `tbl_penduduk`.`id_penduduk`=`tbl_pindah`.`id_penduduk`
ORDER BY `id_pindah` DESC