app/Models/Model_auth.php

    public function login($username, $password, $level)
    {
        return $this->db->table('tbl_user')
            ->where([
                'username' => $username,
                'password' => $password,
                'level' => $level,
            ])->get()->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `username` = 'kawil'
AND `password` = '7110eda4d09e062aa5e4a390b0a572ac0d2c0220'
AND `level` = '2'