app/Models/Model_keluarga.php

    public function alldata()
    {
        return $this->db->table('tbl_keluarga')
            ->orderBy('id_keluarga', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_keluarga`
ORDER BY `id_keluarga` DESC

    public function RincianData($no_kk)
    {
        return $this->db->table('tbl_keluarga')
            ->join('tbl_provinsi', 'tbl_provinsi.id_provinsi=tbl_keluarga.id_provinsi', 'left')
            ->join('tbl_kabupaten', 'tbl_kabupaten.id_kabupaten=tbl_keluarga.id_kabupaten', 'left')
            ->join('tbl_kecamatan', 'tbl_kecamatan.id_kecamatan=tbl_keluarga.id_kecamatan', 'left')
            ->where('no_kk', $no_kk)
            ->get()
            ->getrowArray();
---
SELECT *
FROM `tbl_keluarga`
LEFT JOIN `tbl_provinsi` ON `tbl_provinsi`.`id_provinsi`=`tbl_keluarga`.`id_provinsi`
LEFT JOIN `tbl_kabupaten` ON `tbl_kabupaten`.`id_kabupaten`=`tbl_keluarga`.`id_kabupaten`
LEFT JOIN `tbl_kecamatan` ON `tbl_kecamatan`.`id_kecamatan`=`tbl_keluarga`.`id_kecamatan`
WHERE `no_kk` = '3203182010110002'

    public function AllAnggota($no_kk)
    {
        return $this->db->table('tbl_penduduk')
            ->where('no_kk', $no_kk)
            ->where('status', 1)
            ->orderBy('no_kk', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_penduduk`
WHERE `no_kk` = '3203182010110002'
AND `status` = 1
ORDER BY `no_kk` DESC