app/Models/Model_kematian.php

SELECT *
FROM `tbl_kematian`
LEFT JOIN `tbl_penduduk` ON `tbl_penduduk`.`id_penduduk`=`tbl_kematian`.`id_penduduk`
ORDER BY `id_kematian` DESC
---
    public function AllData()
    {
        return $this->db->table('tbl_kematian')
            ->join('tbl_penduduk', 'tbl_penduduk.id_penduduk=tbl_kematian.id_penduduk', 'left')
            ->orderBy('id_kematian', 'DESC')
            ->get()
            ->getResultArray();

SELECT *
FROM `tbl_penduduk`
WHERE `status` = '1'
---
    public function AllDataPenduduk()
    {
        return $this->db->table('tbl_penduduk')
            ->where('status', '1')
            ->get()
            ->getResultArray();