app/Models/ModelHistory.php

    public function alldata()
    {
        return $this->db->table('tbl_penduduk')
            ->join('tbl_pekerjaan', 'tbl_pekerjaan.id_pekerjaan=tbl_penduduk.id_pekerjaan', 'left')
            ->where('status <> 1')
            ->orderBy('no_kk', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_penduduk`
LEFT JOIN `tbl_pekerjaan` ON `tbl_pekerjaan`.`id_pekerjaan`=`tbl_penduduk`.`id_pekerjaan`
WHERE `status` <> 1
ORDER BY `no_kk` DESC

    public function DetailLahir($id_penduduk)
    {
        return $this->db->table('tbl_penduduk')
            ->join('tbl_kelahiran', 'tbl_kelahiran.id_penduduk=tbl_penduduk.id_penduduk', 'left')
            ->where('tbl_penduduk.id_penduduk', $id_penduduk)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `tbl_penduduk`
LEFT JOIN `tbl_kelahiran` ON `tbl_kelahiran`.`id_penduduk`=`tbl_penduduk`.`id_penduduk`
WHERE `tbl_penduduk`.`id_penduduk` = '1'