app/Models/Model_pendidikan.php

SELECT *
FROM `tbl_pendidikan`
ORDER BY `id_pendidikan` ASC
---
    public function AllData()
    {
        return $this->db->table('tbl_pendidikan')
            ->orderBy('id_pendidikan', 'ASC')
            ->get()
            ->getResultArray();

DELETE FROM `tbl_pendidikan`
WHERE `id_pendidikan` = '15'
AND `id_pendidikan` = '15'
---
    public function DeleteData($data)
    {
        $this->db->table('tbl_pendidikan')
            ->where('id_pendidikan', $data['id_pendidikan'])
            ->delete($data);