app/Models/Model_penduduk.php

SELECT *
FROM `tbl_penduduk`
LEFT JOIN `tbl_pekerjaan` ON `tbl_pekerjaan`.`id_pekerjaan`=`tbl_penduduk`.`id_pekerjaan`
LEFT JOIN `tbl_penghasilan` ON `tbl_penghasilan`.`id_penghasilan`=`tbl_penduduk`.`id_penghasilan`
WHERE `status` = '1'
ORDER BY `no_kk` DESC
---
    public function alldata()
    {
        return $this->db->table('tbl_penduduk')
            ->join('tbl_pekerjaan', 'tbl_pekerjaan.id_pekerjaan=tbl_penduduk.id_pekerjaan', 'left')
            ->join('tbl_penghasilan', 'tbl_penghasilan.id_penghasilan=tbl_penduduk.id_penghasilan', 'left')
            ->where('status', '1')
            ->orderBy('no_kk', 'DESC')
            ->get()
            ->getResultArray();

SELECT *
FROM `tbl_penduduk`
LEFT JOIN `tbl_pendidikan` ON `tbl_pendidikan`.`id_pendidikan`=`tbl_penduduk`.`id_pendidikan`
LEFT JOIN `tbl_pekerjaan` ON `tbl_pekerjaan`.`id_pekerjaan`=`tbl_penduduk`.`id_pekerjaan`
LEFT JOIN `tbl_keluarga` ON `tbl_keluarga`.`no_kk`=`tbl_penduduk`.`no_kk`
LEFT JOIN `tbl_provinsi` ON `tbl_provinsi`.`id_provinsi`=`tbl_keluarga`.`id_provinsi`
LEFT JOIN `tbl_kabupaten` ON `tbl_kabupaten`.`id_kabupaten`=`tbl_keluarga`.`id_kabupaten`
LEFT JOIN `tbl_kecamatan` ON `tbl_kecamatan`.`id_kecamatan`=`tbl_keluarga`.`id_kecamatan`
WHERE `id_penduduk` = '89'
---
    public function detail_data($id_penduduk)
    {
        return $this->db->table('tbl_penduduk')
            ->join('tbl_pendidikan', 'tbl_pendidikan.id_pendidikan=tbl_penduduk.id_pendidikan', 'left')
            ->join('tbl_pekerjaan', 'tbl_pekerjaan.id_pekerjaan=tbl_penduduk.id_pekerjaan', 'left')
            ->join('tbl_penghasilan', 'tbl_penghasilan.id_penghasilan=tbl_penduduk.id_penghasilan', 'left')
            ->join('tbl_keluarga', 'tbl_keluarga.no_kk=tbl_penduduk.no_kk', 'left')
            ->join('tbl_provinsi', 'tbl_provinsi.id_provinsi=tbl_keluarga.id_provinsi', 'left')
            ->join('tbl_kabupaten', 'tbl_kabupaten.id_kabupaten=tbl_keluarga.id_kabupaten', 'left')
            ->join('tbl_kecamatan', 'tbl_kecamatan.id_kecamatan=tbl_keluarga.id_kecamatan', 'left')
            ->where('id_penduduk', $id_penduduk)
            ->get()
            ->getrowArray();