app/Models/Model_kelahiran.php

SELECT *
FROM `tbl_kelahiran`
LEFT JOIN `tbl_penduduk` ON `tbl_penduduk`.`id_penduduk`=`tbl_kelahiran`.`id_penduduk`
ORDER BY `id_lahir` DESC
---
    public function alldata()
    {
        return $this->db->table('tbl_kelahiran')
            ->join('tbl_penduduk', 'tbl_penduduk.id_penduduk=tbl_kelahiran.id_penduduk', 'left')
            ->orderBy('id_lahir', 'DESC')
            ->get()
            ->getResultArray();

INSERT INTO `tbl_kelahiran` (`id_penduduk`, `jam_lahir`, `nama_ayah`, `nama_ibu`) VALUES (81, '23:07', 'Anton Wibowo123', 'Sartini Winiarti')
---
    public function add($data)
    {
        $this->db->table('tbl_kelahiran')->insert($data);

INSERT INTO `tbl_penduduk` (`hubungan_keluarga`, `nama`, `tgl_lahir`, `tempat_lahir`, `no_kk`, `jk`, `agama`) VALUES ('Anak', '123', '2022-12-28', 'Padang', '3333333', 'L', 'Islam')
---
    public function InsertPenduduk($data2)
    {
        $this->db->table('tbl_penduduk')->insert($data2);

SELECT MAX(`id_penduduk`) AS `id_penduduk`
FROM `tbl_penduduk`
---
    public function CekIdPenduduk()
    {
        $penduduk =  $this->db->table('tbl_penduduk')
            ->selectMax('id_penduduk')
            ->get()->getRowArray();