app/Models/Model_bantuan.php

SELECT *
FROM `tbl_bantuan`
ORDER BY `id_bantuan` DESC
---
    public function AllData()
    {
        return $this->db->table('tbl_bantuan')
            ->orderBy('id_bantuan', 'DESC')
            ->get()
            ->getResultArray();

SELECT *
FROM `tbl_penduduk`
LEFT JOIN `tbl_pekerjaan` ON `tbl_pekerjaan`.`id_pekerjaan`=`tbl_penduduk`.`id_pekerjaan`
LEFT JOIN `tbl_penghasilan` ON `tbl_penghasilan`.`id_penghasilan`=`tbl_penduduk`.`id_penghasilan`
LEFT JOIN `tbl_bantuan` ON `tbl_bantuan`.`id_bantuan`=`tbl_penduduk`.`id_bantuan`
WHERE `tbl_penghasilan`.`penerima_bantuan` = '1'
---
    public function PenerimaBantuan()
    {
        return $this->db->table('tbl_penduduk')
            ->join('tbl_pekerjaan', 'tbl_pekerjaan.id_pekerjaan=tbl_penduduk.id_pekerjaan', 'left')
            ->join('tbl_penghasilan', 'tbl_penghasilan.id_penghasilan=tbl_penduduk.id_penghasilan', 'left')
            ->join('tbl_bantuan', 'tbl_bantuan.id_bantuan=tbl_penduduk.id_bantuan', 'left')
            ->where('tbl_penghasilan.penerima_bantuan', '1')
            ->get()
            ->getResultArray();

UPDATE `tbl_penduduk` SET `id_penduduk` = '85', `id_bantuan` = '5'
WHERE `id_penduduk` = '85'
---
    public function UpdatePenerima($data)
    {
        $this->db->table('tbl_penduduk')
            ->where('id_penduduk', $data['id_penduduk'])
            ->update($data);