app/Models/Model_home.php

    public function total_keluarga()
    {
        return $this->db->table('tbl_keluarga')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_keluarga`

    public function total_penduduk()
    {
        return $this->db->table('tbl_penduduk')
            ->where('status', '1')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_penduduk`
WHERE `status` = '1'

    public function total_L()
    {
        return $this->db->table('tbl_penduduk')
            ->where('status', '1')
            ->where('jk', 'L')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_penduduk`
WHERE `status` = '1'
AND `jk` = 'L'

    public function total_P()
    {
        return $this->db->table('tbl_penduduk')
            ->where('status', '1')
            ->where('jk', 'P')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_penduduk`
WHERE `status` = '1'
AND `jk` = 'P'

    public function total_lahir_L()
    {
        return $this->db->table('tbl_kelahiran')
            ->join('tbl_penduduk', 'tbl_penduduk.id_penduduk=tbl_kelahiran.id_penduduk', 'left')
            ->where('jk', 'L')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_kelahiran`
LEFT JOIN `tbl_penduduk` ON `tbl_penduduk`.`id_penduduk`=`tbl_kelahiran`.`id_penduduk`
WHERE `jk` = 'L'

    public function total_lahir_P()
    {
        return $this->db->table('tbl_kelahiran')
            ->join('tbl_penduduk', 'tbl_penduduk.id_penduduk=tbl_kelahiran.id_penduduk', 'left')
            ->where('jk', 'P')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_kelahiran`
LEFT JOIN `tbl_penduduk` ON `tbl_penduduk`.`id_penduduk`=`tbl_kelahiran`.`id_penduduk`
WHERE `jk` = 'P'

    public function total_kelahiran()
    {
        return $this->db->table('tbl_kelahiran')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_kelahiran`

    public function total_kematian()
    {
        return $this->db->table('tbl_kematian')
            ->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_kematian`

    public function total_pindah()
    {
        return $this->db->table('tbl_pindah')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_pindah`

    public function total_pengguna()
    {
        return $this->db->table('tbl_user')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_user`

    public function Web()
    {
        return $this->db->table('tbl_setting')
            ->join('tbl_provinsi', 'tbl_provinsi.id_provinsi=tbl_setting.id_provinsi', 'left')
            ->join('tbl_kabupaten', 'tbl_kabupaten.id_kabupaten=tbl_setting.id_kabupaten', 'left')
            ->join('tbl_kecamatan', 'tbl_kecamatan.id_kecamatan=tbl_setting.id_kecamatan', 'left')
            ->where('id', 1)
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_setting`
LEFT JOIN `tbl_provinsi` ON `tbl_provinsi`.`id_provinsi`=`tbl_setting`.`id_provinsi`
LEFT JOIN `tbl_kabupaten` ON `tbl_kabupaten`.`id_kabupaten`=`tbl_setting`.`id_kabupaten`
LEFT JOIN `tbl_kecamatan` ON `tbl_kecamatan`.`id_kecamatan`=`tbl_setting`.`id_kecamatan`
WHERE `id` = 1